{
    "slug": "cale",
    "title": "Anspruchsvolle Workout-Tracking-App",
    "story_preview": "lyftd ist eine anspruchsvolle Plattform, die Nutzern hilft, ihre Trainingspläne zu erstellen, zu verwalten und zu verfolgen. Gebaut auf einem modernen Tech-Stack mit Fokus auf sauberen Code und Skalierbarkeit, bietet sie ein nahtloses Erlebnis für Fitness-Enthusiasten.",
    "story": "# Ich konnte keinen Workout-Tracker finden, der mir gefiel – also habe ich meinen eigenen gebaut.\n\nlyftd entstand aus persönlicher Frustration mit bestehenden Fitness-Apps – sie waren entweder umständlich, voller Werbung oder hatten nicht die Flexibilität, die ich brauchte. Ich wollte ein Tool, das sich premium anfühlt, nahtlos auf all meinen Geräten funktioniert und sich meinem Trainingsstil anpasst.\n\n## Die Vision\n\nMein Ziel war es, eine modulare, hochperformante Webanwendung zu schaffen, die als umfassender Begleiter für Fitness-Enthusiasten dient. Es geht nicht nur darum, Gewichte zu protokollieren; es geht darum, den gesamten Lebenszyklus eines Trainingsprogramms zu managen. Vom Erstellen komplexer Mehrwochen-Pläne mit Drag-and-Drop bis hin zur Durchführung von Sessions mit Fokus auf Flow und Effizienz – jede Interaktion ist auf Reibungslosigkeit ausgelegt.\n\n## Unter der Haube\n\nAls Solo-Entwickler nutzte ich lyftd als Testfeld für die Erkundung der Full-Stack-Produktentwicklung. Aufgebaut auf einem robusten **Laravel**-Backend mit einem **Vue.js**-Frontend powered by **Inertia.js**, liefert die App ein modernes Single Page Application (SPA)-Erlebnis ohne die Komplexität einer separaten API. Die UI, gestaltet mit **Tailwind CSS**, ist Dark-Mode-first und datenreich konzipiert.\n\n## Feature Deep Dive\n\nDas Herzstück von lyftd ist seine Workout-Ausführungs-Engine. Sie handhabt alles von RPE (Rate of Perceived Exertion)-Tracking bis hin zu automatischen Pausentimern und Set-Protokollierung. Über den Gym-Floor hinaus bietet die Plattform ein leistungsstarkes Progressionssystem. Es visualisiert Volumentrends, trackt persönliche Rekorde und nutzt sogar **OpenAI**, um personalisierte Workout-Zusammenfassungen und motivierendes Feedback zu generieren.\n\nUm ein nachhaltiges Modell zu unterstützen, habe ich ein vollständiges Abo-System mit Standard- und Elite-Stufen integriert, verwaltet über ein Admin-Panel, das mit **Filament** gebaut wurde. Dies ermöglicht granulare Kontrolle über Benutzerverwaltung, Übungsbibliotheken und Plattformmetriken.\n\n## Eine kontinuierliche Reise\n\nlyftd ist mehr als nur ein Produkt; es ist eine lebendige Bildungssandbox. Es entwickelt sich ständig weiter, während ich mit neuen Technologien experimentiere, und gibt mir praktische Erfahrung im Management einer produktionsreifen Anwendung – vom Datenbankschema-Design bis zu Deployment und Benutzer-Support.",
    "fineprint": "Dieses Projekt habe ich komplett alleine entwickelt, um tief in die Full-Stack-Produktentwicklung einzutauchen. Es dient als meine persönliche Sandbox, um jeden Aspekt der Erstellung und Verwaltung einer modernen Webanwendung zu meistern – von der Backend-Logik bis zum Frontend-Design."
}
