{
    "slug": "gastroenterologie-kassel",
    "title": "Arztpraxis-Website mit minimalistischem Branding",
    "story_preview": "Dr. med. H. Habibi kam mit einem dringenden Anliegen auf mich zu: Er übernahm eine Arztpraxis und brauchte schnell eine professionelle Web-Präsenz. Ich lieferte eine maßgeschneiderte, SEO-optimierte Website mit einer grundlegenden Markenidentität — alles in kürzester Zeit.",
    "story": "# Schnelligkeit trifft Präzision\n\nAls Dr. med. H. Habibi eine Arztpraxis übernahm, brauchte er mehr als nur eine Website — er brauchte eine grundlegende digitale Identität, und zwar schnell. Patienten mussten wesentliche Informationen über den neuen Arzt, seine Qualifikationen, angebotene Leistungen und Öffnungszeiten ohne Verzögerung finden können.\n\n## Von Grund auf neu gebaut, optimiert für Geschwindigkeit\n\nMit einer engen Deadline habe ich die gesamte Seite von Grund auf mit **Laravel**, **Vue.js** und **Inertia.js** entwickelt, gestylt mit **Tailwind CSS**. Jede Entscheidung wurde mit Performance im Hinterkopf getroffen — das Ergebnis ist eine blitzschnelle Website, optimiert für Ladezeiten und SEO, damit Patienten die Praxis leicht über die Suche finden können.\n\n## Markenidentität im Komplettpaket\n\nDer Arzt hatte keine etablierte visuelle Identität, also habe ich eine erstellt: ein stimmiges Markenpaket mit einer ausgewählten **Schriftart**, **Farbpalette**, **Icon-Logo**, **Favicon** und passenden **Meta-Bildern** für Social Sharing. Dies verlieh der Praxis vom ersten Tag an ein professionelles, vertrauenswürdiges Erscheinungsbild.\n\n## Bewegung & Interaktivität\n\nUm das Nutzererlebnis über eine statische Arztpraxis-Website hinaus zu heben, habe ich **VueUse Motion** für flüssige Animationen beim Seitenladen und scroll-basierte Interaktionen integriert. Da die Seite eine vollständige Single Page Application mit Inertia.js ist, habe ich auch nahtlose **Seitenübergänge** implementiert — kein ruckartiges Neuladen, sondern fließende Navigation zwischen Seiten und Bereichen.\n\n## Das Ergebnis\n\nEine moderne, schnelle und professionelle Web-Präsenz, die Patienten hilft, die benötigten Informationen zu finden, und Dr. Habibis Praxis als vertrauenswürdige Anlaufstelle für Gastroenterologie etabliert.",
    "fineprint": "Ein Projekt mit engem Zeitrahmen, das beweist, dass knappe Deadlines nicht bedeuten, Abstriche machen zu müssen. Individuelle Entwicklung, grundlegende Markenidentität und SEO-Optimierung — alles schnell geliefert, ohne Kompromisse bei der Qualität."
}
