{
    "slug": "icemaenner",
    "title": "High-Energy B2B & B2C E-Commerce Experience",
    "story_preview": "Ein hochenergetisches, trendorientiertes globales Commerce-Erlebnis für ICEMÄNNER. Mit einem maßgeschneiderten Shopify-Setup inklusive neuester B2B/B2C-Logik, automatisierter Lagerintegration und einem Design, das so richtig reinhaut.",
    "story": "# High Voltage Commerce\n\nICEMÄNNER ist nicht nur Eis – es ist ein Lifestyle. Als Mitgründer und Lead Web Dev bei **unlimited.studio** habe ich die technische Umsetzung der starken Vision von ICEMÄNNER geleitet und eine Marke unter Hochspannung in eine High-Performance E-Commerce-Realität verwandelt.\n\n## Maßgeschneiderte Theme-Architektur\n\nDas Theme wurde von uns von Grund auf entwickelt und gestaltet. Es umfasst maßgeschneiderte Illustrationen, intensive Animationen und spezielle Scroll-Effekte, um High-Res-Assets mit einer rasanten Performance in Einklang zu bringen und ein wirklich immersives Markenerlebnis zu schaffen.\n\n## Automatisierte Bestandslogik\n\nUm Komplexität mit Einfachheit zu vereinen, haben wir Shopify Flow für eine moderne Varianten-Lagerverwaltung und komplexe Rabattlogik eingesetzt. \n- **Smarte Bestände:** Wir haben ein System implementiert, bei dem 50er-Packs aus 5x 10er-Packs bestehen, die dieselbe SKU teilen. \n- **Storefront-Integration:** Eine maßgeschneiderte Logik im Theme und im Storefront verwaltet diese Beziehungen und garantiert Bestandsgenauigkeit sowie einen automatisierten Versand, während das Kundenerlebnis nahtlos bleibt.\n\n## Integriertes B2B-Portal\n\nIm Hintergrund bedient ein robustes B2B-Portal die Handelspartner mit Gated Access und maßgeschneiderten Payment-Gateways. Dies beweist, dass ein Store „TikTok-famous“ aussehen kann, während er im Hintergrund wie eine Fortune-500-Logistikoperation läuft.",
    "fineprint": "Engineered for the hype. Ein Showcase in der Balance zwischen viraler Ästhetik und kompromissloser B2B-Logistik – damit der Shop genauso schnell skaliert wie die Marke wächst."
}
