{
    "slug": "icemaenner",
    "title": "High-Energy B2B & B2C E-Commerce Experience",
    "story_preview": "Ein hochenergetisches, trendorientiertes globales Commerce-Erlebnis für ICEMÄNNER. Mit einem maßgeschneiderten Shopify-Setup inklusive fortschrittlicher B2B/B2C-Logik, automatisierter Lagerintegration und einem Design, das so richtig reinhaut.",
    "story": "# High Voltage Commerce\n\nICEMÄNNER ist nicht nur Eis – es ist ein Lifestyle. Als Mitgründer und Lead Web Dev bei **unlimited** habe ich die technische Umsetzung dieser mutigen Vision geleitet und eine Marke unter Hochspannung in eine High-Performance-E-Commerce-Realität verwandelt.\n\n## B2C: Viral Speed\n\nDer öffentliche Store ist auf Geschwindigkeit und Konversion ausgelegt und spiegelt die Dynamik der Marke in den sozialen Medien wider.\n- **Dynamische Preisgestaltung:** Implementierung komplexer Varianten- und Mengenrabattlogik, die Ersparnisse in Echtzeit berechnet.\n- **Visueller Impact:** Ein maßgeschneidertes Theme, das High-Res-Assets mit blitzschneller Performance in Einklang bringt.\n\n## B2B: Locked & Loaded\n\nIm Hintergrund bedient ein robustes B2B-Portal die Handelspartner.\n- **Gated Access:** Passwortgeschützte Umgebungen für Wholesale-Preise.\n- **Custom Payments:** Maßgeschneiderte Payment-Gateways und Konditionen für Geschäftskunden.\n\n## Integrationen & Automatisierung\n\nUm den Flow ohne operative Reibungsverluste am Laufen zu halten, habe ich die Backend-Logik entwickelt:\n- **Shopify Flows:** Automatisierte Workflows für Order-Tagging, Betrugsanalysen und Kundensegmentierung.\n- **Warehouse Sync:** Echtzeit-Integration mit Logistikpartnern, um Bestände präzise und den Versand sofort zu garantieren.\n\nDieses Projekt beweist, dass ein Store „TikTok-famous“ aussehen kann, während er im Hintergrund wie eine Fortune-500-Logistikoperation läuft.",
    "fineprint": "Engineered for the hype. Eine technische Masterclass in der Balance zwischen viraler Ästhetik und kompromissloser B2B-Logistik – damit der Shop genauso schnell skaliert wie die Marke wächst."
}
