{
    "slug": "loz",
    "title": "DTC Shopify Store für Mundpflege Startup",
    "story_preview": "Ein brutalistischer, wirkungsstarker Shopify Store für Loz — feuchtigkeitsspendende Minz-Lutschtabletten gegen Mundtrockenheit. Mit einem komplett maßgeschneiderten Theme, Instagram-Style-Slidern, animierter Rabattlogik und einem Abo-Flow powered by ReCharge.",
    "story": "# Eine kleine Lösung für ein großes Problem\n\n1 von 5 Menschen leidet täglich unter Mundtrockenheit. Loz liefert Erleichterung im Taschenformat mit medizinischen, natürlichen Inhaltsstoffen – und das E-Commerce-Erlebnis, das diesem mutigen Versprechen gerecht wird.\n\n## Brutalistisch by Design\n\nIch habe das Theme von Grund auf entwickelt und am Design leitend mitgewirkt. Die Ästhetik ist bewusst **brutalistisch, mutig und farbenfroh** — ohne Schnickschnack, voller Persönlichkeit. Jedes Pixel unterstreicht den direkten, kompromisslosen Ansatz der Marke für Mundpflege.\n\n## Ein maßgeschneidertes, interaktives Produkterlebnis\n\nDie Produktdetailseite ist auf maximale Interaktion ausgelegt. Auf dem Desktop bietet sie ein **50/50-Split-Layout**, bei dem die linke Seite sticky bleibt, während Nutzer auf der rechten Seite durch Benefits und Reviews scrollen — ein einzigartiges, fesselndes Gefühl, das das Produkt immer im Fokus hält.\n\n- **Gestenbasierter Medien-Slider:** Produktbilder wischen sich durch wie Stories — perfekt für eine Mobile-First-Zielgruppe.\n- **Maßgeschneiderte Reviews-Integration:** Eine vollständig angepasste Reviews-App mit **Video- und Bild-Reviews** von echten Kunden.\n- **Dynamisches Lutschtabletten-Icon:** Eine maßgeschneiderte „Tropfen\"-Illustration aktualisiert sich in Echtzeit und zeigt die Anzahl der Lutschtabletten basierend auf der gewählten Variante und Menge.\n\n## Logikgesteuerter Abo-Flow\n\nDer Kaufprozess ist auf Conversion optimiert:\n- **Varianten-Auswahl:** Nutzer wählen zwischen 1er- oder 2er-Pack, mit inline +/- Mengensteuerung direkt im 2er-Pack-Button.\n- **Bestellfrequenz-Toggle:** Einmalkauf oder monatliches Abo, nahtlos integriert mit **ReCharge**.\n- **Animierte Rabatt-Balken:** Zwei Fortschrittsbalken animieren sich und zeigen Gratis-Versand-Eligibilität sowie gestaffelte Rabatte (z.B. 20% Rabatt bei monatlichen 2er-Pack-Bestellungen).\n- **Custom Warenkorb-Icon:** Das Warenkorb-Icon füllt sich visuell mit mehr Lutschtabletten-„Tropfen\", je mehr Menge hinzugefügt wird — eine befriedigende Mikro-Interaktion.\n\n## URLs & Marketing-Infrastruktur\n\nJede Varianten- und Frequenz-Kombination hat ihre eigene **maßgeschneiderte Produkt-URL**, was präzise Attribution für Werbekampagnen ermöglicht. Der Store ist für Wachstum verkabelt mit **Klaviyo** für E-Mail-Flows und der **Shopify Marketing App** für Newsletter-Erfassung.",
    "fineprint": "Brutalistischer E-Commerce, konzipiert für Conversion. Ein maßgeschneiderter Shopify-Build, der mutige Ästhetik mit Abo-Logik und gestaffelten Rabatt-Flows in Einklang bringt – bereit, mit der Marke zu skalieren."
}
